{
  "home": {
    "title": "About Me",
    "occupation": "Game Developer",
    "aboutMe": "  Hi there and welcome to my revamped website! If you're on this website, then I suppose that you know quite a bit about me. For those who don't, I'm just a guy who used to study Anatomy and Cell Biology (hated it and felt like I was wasting my time) and decided to start programming in 2014. After browsing very many dank memes on programming, I participated in Ubisoft's Game Lab competition. Thanks to this competition, I am able to work at Ubisoft Montreal as a programmer and it's totally awesome. You'll find my projects here as well as some random protip blog posts that I've written. This website was made by taking a free Bootstrap template and replacing its logic with React. Gulp was the template's default package handler so I extended it to suppot JSX files. I hope you like this website!"
  },
  "CV": {
      "title": "Curriculum Vitae",
      "description": "This is a shortened form of my CV. If you want more details, you can send me an email and I'll send you my beautifully latexed version.",
      "url" : "none",
      "image": "img/profile.jpg",
      "date": "December 1st 2016",
      "content": {
        "Education": {
          "McGill": {
            "details": {"Bachelor of Science": "Liberal CSC Anat. & Cell Biology and CSC Comp. Sci."},
            "date": "September 2012-May 2016"
          },
          "Collège Jean-de-Brébeuf (cegep)": {
            "details": {"Diplôme d'Études Collégiales": "Health Sciences"},
            "date": "September 2010-May 2012"
          },
          "Collège Jean-de-Brébeuf (secondaire)": {
          "details": {"Diplôme d'Études Secondaires": ""},
          "date": "September 2005-June 2010"
        }
        },
        "Work Experience": {
          "Ubisoft Montreal": {
            "details":{"Generalist Programmer. Part of the Online \"Live\" Team.": ""},
          "date": "May 2016-"
          }
        }
    }
  },
  "portfolio":{
    "title": "Portfolio",
    "personalProjects": {
      "burlapCraft": {
        "title": "BurlapCraft",
        "content": "blabla",
        "url": "none",
        "image": "img/portfolio/burlapcraft.png",
        "date": "April 20th 2016"
      },
      "mcGameJam": {
        "title": "McGame Jam Website",
        "content": "A simple single-page website with reload-free language switching for an event",
        "url": "none",
        "image": "img/portfolio/mcGameJam.png",
        "date": "March 16th 2016"
      },
      "worship": {
        "title": "Worship",
        "content": "3D game prototype with an ocean theme",
        "url": "none",
        "image": "img/portfolio/worship.png",
        "date": "March 24th 2016"
      },
      "GoCaml": {
        "title": "GoCaml",
        "content": "A Go-lite to Python compiler in OCaml",
        "url": "none",
        "image": "img/portfolio/GoCaml.png",
        "date": "April 20th 2016"
      }
    }
  },
  "blog": {
    "turkey": {
      "title": "How to Cook Tender Turkey (non brined)",
      "summary": "The instructions for this roast recipe will require far more time than your ordinary recipes but you will never run the risk of dryness unlike them.",
      "content": ["The total prep work and cooking time should take around 9 hours for a 14lbs turkey. Brining isn't necessary for tenderness in this version but could bring in more flavour."
        ,"7kg: Thawing lasts 5 days if using the fridge"
        ,"Preparation is simple: use your skin to loosen the skin from the flesh of the bird, then rub butter and herbs of your choice under it. I personally use nutmeg, oregano, parsley, bay leaves, thyme and rosemary."
        ,"Put a halved lemon and an onion in the cavity of the turkey. Lay some root veg such as potatoes, turnips, carrots, rutabagas in the tray and put the turkey over them."],
      "img": "",
      "date": "November 20th 2016"
    },
    "turkey (brined)":{
      "title": "How to Cook Tender Turkey (brined)",
      "summary": "Similar to the non brined version, except with less time consumption",
      "content": ["The turkey can be thawed for 4 days instead of 5 if your fridge isn't large enough. If you do not have a brining bag, use a pot that can contain entirety of the turkey and fill with salt water and pepper and let brine for 24 hours."
      ,"After 24 hours, wash off brine and proceed with the seasoning and prep work as mentioned above."
      ,"Roasting is as follows:"
      ,"400 degrees 20 minutes no foil, add 1/2 cup water"
      ,"350 degrees for 4 hours + cover, baste every hours"
      ,"400 degrees for 15 minutes with no cover baste and let rest for an hour"]
    },
    "squash":{
      "title": "About Spaghetti Squashes",
      "summary": "Extremely versatile and easy to store vegetable",
      "content": ["It is a good idea to stock up on squashes during the fall for the winter as they can last for months. Simply put them on egg cartons in a dark cool room.",""],
      "img": "",
      "date": ""
    }
  }
}
